#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️``
#### Terraform Validation 🤖``
<details><summary>Validation Output</summary>

```


```

</details>

#### Terraform Plan 📖`failure`

<details><summary>Show Plan</summary>

```

terraform
aws_subnet.public[0]: Refreshing state... [id=subnet-048eedd36dc7ac201]
aws_iam_role_policy_attachment.task_s3: Refreshing state... [id=ecs-task-role-20240819081517975400000001]
aws_vpc.main: Refreshing state... [id=vpc-034dd95974f394745]
aws_iam_role_policy_attachment.codebuild_attach: Refreshing state... [id=codebuild-role-20240904142512940700000002]
aws_lb.gtw_alb: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-west-1:802288441694:loadbalancer/app/gtw-alb/1504e27b1a9387be]
aws_iam_role.codepipeline_role: Refreshing state... [id=codepipeline-role]
aws_subnet.public[1]: Refreshing state... [id=subnet-0fe80fa5495cb3632]
aws_lb_target_group.gtw_service_blue_tg: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-west-1:802288441694:targetgroup/gtw-service-tg/c69fd0aeab02a1e0]
aws_iam_role_policy_attachment.ecs_auto_scale_role: Refreshing state... [id=EcsAutoScaleRole-20240819195525719600000001]
aws_ecs_service.gtw_service: Refreshing state... [id=arn:aws:ecs:eu-west-1:802288441694:service/asics-cluster/gtw-service]
aws_iam_role_policy_attachment.codedeploy_attach: Refreshing state... [id=codedeploy-role-20240904142512929600000001]
aws_ecs_service.bff_service: Refreshing state... [id=arn:aws:ecs:eu-west-1:802288441694:service/asics-cluster/bff-service]
aws_lb_target_group.bff_service_blue_tg: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-west-1:802288441694:targetgroup/bff-service-tg/0d4dcd8f3e55c5db]
aws_lb_listener.gtw_listener: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-west-1:802288441694:listener/app/gtw-alb/1504e27b1a9387be/8e7e051be87c920e]
aws_iam_role_policy_attachment.codepipeline_attach: Refreshing state... [id=codepipeline-role-20240904144125435300000001]
aws_subnet.private[0]: Refreshing state... [id=subnet-036a5e724b44fa8df]
aws_internet_gateway.gw: Refreshing state... [id=igw-0fb286c9a49c0be0d]
aws_subnet.private[1]: Refreshing state... [id=subnet-0a15b82f75b3300cd]
aws_ecs_cluster.main: Refreshing state... [id=arn:aws:ecs:eu-west-1:802288441694:cluster/asics-cluster]
aws_iam_role_policy.codepipeline_service_role_policy: Refreshing state... [id=codepipeline-role:terraform-20240904145455424300000001]
aws_cloudwatch_log_group.gtw_service_log_group: Refreshing state... [id=/ecs/gtw-service]
module.iam.data.aws_iam_policy_document.ecs_auto_scale_role: Reading...
module.vpc.data.aws_availability_zones.available: Reading...
module.iam.data.aws_iam_policy_document.ecs_auto_scale_role: Read complete after 0s [id=3468681342]
aws_iam_role.codebuild_role: Refreshing state... [id=codebuild-role]
aws_lb_listener.dev_listener: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-west-1:802288441694:listener/app/bff-alb/5aa868ff550d2701/ce2ba0c83e75b924]
aws_iam_role.codedeploy_role: Refreshing state... [id=codedeploy-role]
aws_s3_bucket.build_artifacts: Refreshing state... [id=my-build-artifacts-bucket-asics]
aws_ecs_task_definition.bff_service_app: Refreshing state... [id=bff-service-app-task]
aws_ecs_task_definition.gtw_service_app: Refreshing state... [id=gtw-service-app-task]
aws_iam_role_policy.codedeploy_service_role_policy: Refreshing state... [id=codedeploy-role:terraform-20240905103713269900000002]
module.vpc.data.aws_availability_zones.available: Read complete after 0s [id=eu-west-1]
aws_iam_role.ecs_auto_scale_role: Refreshing state... [id=EcsAutoScaleRole]
aws_cloudwatch_log_group.redis_cache_log_group: Refreshing state... [id=/cache/redis]
aws_codestarconnections_connection.github_connection: Refreshing state... [id=arn:aws:codestar-connections:eu-west-1:802288441694:connection/1b430daa-4436-49d6-a3a6-bd27b73947db]
aws_dynamodb_table.sbx_dynamodb: Refreshing state... [id=remote-state-lock-acics]
aws_lb.bff_alb: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-west-1:802288441694:loadbalancer/app/bff-alb/5aa868ff550d2701]
aws_iam_role_policy_attachment.ecs-task-execution-role-policy-attachment: Refreshing state... [id=ecs-execution-role-20240819081518024600000002]
aws_iam_role.ecs_task_role: Refreshing state... [id=ecs-task-role]
aws_iam_role_policy.codebuild_service_role_policy: Refreshing state... [id=codebuild-role:terraform-20240905103713269500000001]
aws_iam_role.ecs_task_execution_role: Refreshing state... [id=ecs-execution-role]
aws_route.internet_access: Refreshing state... [id=r-rtb-026c0f34bf1cafc1e1080289494]
aws_s3_bucket.tf-bucket: Refreshing state... [id=remote-state-acics]
aws_cloudwatch_log_group.bff_service_log_group: Refreshing state... [id=/ecs/bff-service]
aws_codebuild_project.build_project: Refreshing state... [id=arn:aws:codebuild:eu-west-1:802288441694:project/bff-codebuild-project]
aws_security_group.gtw_lb: Refreshing state... [id=sg-0ddc9f6d8fb60802e]
aws_cloudwatch_log_stream.gtw_service_log_stream: Refreshing state... [id=gtw-service-log-stream]
aws_elasticache_subnet_group.redis_subnet_group: Refreshing state... [id=redis-subnet-group]
aws_cloudwatch_log_stream.redis_cache_log_stream: Refreshing state... [id=redis-log-stream]
aws_security_group.gtw_ecs_tasks: Refreshing state... [id=sg-0f505df8b5227d2be]
aws_cloudwatch_log_stream.bff_service_log_stream: Refreshing state... [id=bff-service-log-stream]
aws_security_group.lb: Refreshing state... [id=sg-05b6da332a709d6c8]
aws_security_group.ecs_tasks: Refreshing state... [id=sg-06e777883e1f5464b]
aws_security_group.redis_sg: Refreshing state... [id=sg-0c9a22295813f5385]
aws_elasticache_replication_group.redis: Refreshing state... [id=my-redis-cluster]
aws_codepipeline.codepipeline: Refreshing state... [id=bff-pipeline]
aws_s3_bucket_public_access_block.sbx_bucket_pa: Refreshing state... [id=remote-state-acics]
aws_s3_bucket_versioning.sbx_bucket_vers: Refreshing state... [id=remote-state-acics]
aws_s3_bucket_server_side_encryption_configuration.sbx_bucket_sse: Refreshing state... [id=remote-state-acics]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy
-/+ destroy and then create replacement
 <= read (data resources)

Terraform planned the following actions, but then encountered a problem:

  # data.aws_elasticache_replication_group.redis_cluster will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_elasticache_replication_group" "redis_cluster" {
      + arn                            = (known after apply)
      + auth_token_enabled             = (known after apply)
      + automatic_failover_enabled     = (known after apply)
      + configuration_endpoint_address = (known after apply)
      + description                    = (known after apply)
      + id                             = (known after apply)
      + log_delivery_configuration     = (known after apply)
      + member_clusters                = (known after apply)
      + multi_az_enabled               = (known after apply)
      + node_type                      = (known after apply)
      + num_cache_clusters             = (known after apply)
      + num_node_groups                = (known after apply)
      + number_cache_clusters          = (known after apply)
      + port                           = (known after apply)
      + primary_endpoint_address       = (known after apply)
      + reader_endpoint_address        = (known after apply)
      + replicas_per_node_group        = (known after apply)
      + replication_group_description  = (known after apply)
      + replication_group_id           = "my-redis-cluster"
      + snapshot_retention_limit       = (known after apply)
      + snapshot_window                = (known after apply)
    }

  # aws_codebuild_project.build_project will be updated in-place
  ~ resource "aws_codebuild_project" "build_project" {
        id                     = "arn:aws:codebuild:eu-west-1:802288441694:project/bff-codebuild-project"
        name                   = "bff-codebuild-project"
      ~ service_role           = "arn:aws:iam::802288441694:role/codebuild-role" -> (known after apply)
        tags                   = {}
        # (8 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

  # aws_codepipeline.codepipeline will be updated in-place
  ~ resource "aws_codepipeline" "codepipeline" {
        id       = "bff-pipeline"
        name     = "bff-pipeline"
      ~ role_arn = "arn:aws:iam::802288441694:role/codepipeline-role" -> (known after apply)
        tags     = {}
        # (2 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # aws_ecs_cluster.main will be destroyed
  # (because aws_ecs_cluster.main is not in configuration)
  - resource "aws_ecs_cluster" "main" {
      - arn                = "arn:aws:ecs:eu-west-1:802288441694:cluster/asics-cluster" -> null
      - capacity_providers = [] -> null
      - id                 = "arn:aws:ecs:eu-west-1:802288441694:cluster/asics-cluster" -> null
      - name               = "asics-cluster" -> null
      - tags               = {} -> null
      - tags_all           = {} -> null

      - setting {
          - name  = "containerInsights" -> null
          - value = "disabled" -> null
        }
    }

  # aws_ecs_service.bff_service will be destroyed
  # (because aws_ecs_service.bff_service is not in configuration)
  - resource "aws_ecs_service" "bff_service" {
      - cluster                            = "arn:aws:ecs:eu-west-1:802288441694:cluster/asics-cluster" -> null
      - deployment_maximum_percent         = 200 -> null
      - deployment_minimum_healthy_percent = 100 -> null
      - desired_count                      = 2 -> null
      - enable_ecs_managed_tags            = false -> null
      - enable_execute_command             = false -> null
      - health_check_grace_period_seconds  = 0 -> null
      - iam_role                           = "/aws-service-role/ecs.amazonaws.com/AWSServiceRoleForECS" -> null
      - id                                 = "arn:aws:ecs:eu-west-1:802288441694:service/asics-cluster/bff-service" -> null
      - launch_type                        = "FARGATE" -> null
      - name                               = "bff-service" -> null
      - platform_version                   = "LATEST" -> null
      - propagate_tags                     = "NONE" -> null
      - scheduling_strategy                = "REPLICA" -> null
      - tags                               = {} -> null
      - tags_all                           = {} -> null
      - task_definition                    = "arn:aws:ecs:eu-west-1:802288441694:task-definition/bff-service-app-task:11" -> null
      - triggers                           = {} -> null
      - wait_for_steady_state              = false -> null

      - deployment_circuit_breaker {
          - enable   = false -> null
          - rollback = false -> null
        }

      - deployment_controller {
          - type = "ECS" -> null
        }

      - load_balancer {
          - container_name   = "bff-service" -> null
          - container_port   = 8081 -> null
          - target_group_arn = "arn:aws:elasticloadbalancing:eu-west-1:802288441694:targetgroup/bff-service-tg/0d4dcd8f3e55c5db" -> null
        }

      - network_configuration {
          - assign_public_ip = true -> null
          - security_groups  = [
              - "sg-06e777883e1f5464b",
            ] -> null
          - subnets          = [
              - "subnet-036a5e724b44fa8df",
              - "subnet-0a15b82f75b3300cd",
            ] -> null
        }
    }

  # aws_ecs_service.gtw_service will be destroyed
  # (because aws_ecs_service.gtw_service is not in configuration)
  - resource "aws_ecs_service" "gtw_service" {
      - cluster                            = "arn:aws:ecs:eu-west-1:802288441694:cluster/asics-cluster" -> null
      - deployment_maximum_percent         = 200 -> null
      - deployment_minimum_healthy_percent = 100 -> null
      - desired_count                      = 2 -> null
      - enable_ecs_managed_tags            = false -> null
      - enable_execute_command             = false -> null
      - health_check_grace_period_seconds  = 0 -> null
      - iam_role                           = "/aws-service-role/ecs.amazonaws.com/AWSServiceRoleForECS" -> null
      - id                                 = "arn:aws:ecs:eu-west-1:802288441694:service/asics-cluster/gtw-service" -> null
      - launch_type                        = "FARGATE" -> null
      - name                               = "gtw-service" -> null
      - platform_version                   = "LATEST" -> null
      - propagate_tags                     = "NONE" -> null
      - scheduling_strategy                = "REPLICA" -> null
      - tags                               = {} -> null
      - tags_all                           = {} -> null
      - task_definition                    = "arn:aws:ecs:eu-west-1:802288441694:task-definition/gtw-service-app-task:15" -> null
      - triggers                           = {} -> null
      - wait_for_steady_state              = false -> null

      - deployment_circuit_breaker {
          - enable   = false -> null
          - rollback = false -> null
        }

      - deployment_controller {
          - type = "ECS" -> null
        }

      - load_balancer {
          - container_name   = "gtw-service" -> null
          - container_port   = 8080 -> null
          - target_group_arn = "arn:aws:elasticloadbalancing:eu-west-1:802288441694:targetgroup/gtw-service-tg/c69fd0aeab02a1e0" -> null
        }

      - network_configuration {
          - assign_public_ip = true -> null
          - security_groups  = [
              - "sg-0f505df8b5227d2be",
            ] -> null
          - subnets          = [
              - "subnet-036a5e724b44fa8df",
              - "subnet-0a15b82f75b3300cd",
            ] -> null
        }
    }

  # aws_ecs_task_definition.bff_service_app will be destroyed
  # (because aws_ecs_task_definition.bff_service_app is not in configuration)
  - resource "aws_ecs_task_definition" "bff_service_app" {
      - arn                      = "arn:aws:ecs:eu-west-1:802288441694:task-definition/bff-service-app-task:10" -> null
      - arn_without_revision     = "arn:aws:ecs:eu-west-1:802288441694:task-definition/bff-service-app-task" -> null
      - container_definitions    = jsonencode(
            [
              - {
                  - cpu              = 512
                  - environment      = [
                      - {
                          - name  = "CACHE_CONFIG_TTL"
                          - value = "60"
                        },
                      - {
                          - name  = "CLUTCH_BASE_URL"
                          - value = "https://id-sandbox.asics.com"
                        },
                      - {
                          - name  = "CLUTCH_BULKHEAD_MAX_CONCURRENT_CALLS"
                          - value = "100"
                        },
                      - {
                          - name  = "CLUTCH_CIRCUIT_BREAKER_FAILURE_RATE_THRESHOLD"
                          - value = "50"
                        },
                      - {
                          - name  = "CLUTCH_CIRCUIT_BREAKER_PERMITTED_NUMBER_OF_CALLS_IN_HALF_OPEN_STATE"
                          - value = "5"
                        },
                      - {
                          - name  = "CLUTCH_CIRCUIT_BREAKER_RING_BUFFER_SIZE_IN_CLOSED_STATE"
                          - value = "100"
                        },
                      - {
                          - name  = "CLUTCH_CIRCUIT_BREAKER_RING_BUFFER_SIZE_IN_HALF_OPEN_STATE"
                          - value = "10"
                        },
                      - {
                          - name  = "CLUTCH_CIRCUIT_BREAKER_WAIT_DURATION_IN_OPEN_STATE"
                          - value = "30s"
                        },
                      - {
                          - name  = "CLUTCH_RATE_LIMITER_CAPACITY"
                          - value = "2"
                        },
                      - {
                          - name  = "CLUTCH_RATE_LIMITER_PERIOD"
                          - value = "60"
                        },
                      - {
                          - name  = "CLUTCH_RATE_LIMITER_TOKENS"
                          - value = "10"
                        },
                      - {
                          - name  = "CLUTCH_RETRY_MAX_ATTEMPTS"
                          - value = "3"
                        },
                      - {
                          - name  = "CLUTCH_RETRY_WAIT_DURATION"
                          - value = "500ms"
                        },
                      - {
                          - name  = "CLUTCH_TIME_LIMITER_TIMEOUT_DURATION"
                          - value = "2s"
                        },
                      - {
                          - name  = "GRAPHIQL_ENABLED"
                          - value = "false"
                        },
                      - {
                          - name  = "REDIS_NODES"
                          - value = ""
                        },
                      - {
                          - name  = "SPRING_PROFILES_ACTIVE"
                          - value = "dev"
                        },
                    ]
                  - essential        = true
                  - image            = "802288441694.dkr.ecr.eu-west-1.amazonaws.com/asics-bff:latest"
                  - logConfiguration = {
                      - logDriver = "awslogs"
                      - options   = {
                          - awslogs-group         = "/ecs/bff-service"
                          - awslogs-region        = "eu-west-1"
                          - awslogs-stream-prefix = "ecs"
                        }
                    }
                  - memory           = 1024
                  - mountPoints      = []
                  - name             = "bff-service"
                  - portMappings     = [
                      - {
                          - containerPort = 8081
                          - hostPort      = 8081
                          - protocol      = "tcp"
                        },
                    ]
                  - systemControls   = []
                  - volumesFrom      = []
                },
            ]
        ) -> null
      - cpu                      = "512" -> null
      - execution_role_arn       = "arn:aws:iam::802288441694:role/ecs-execution-role" -> null
      - family                   = "bff-service-app-task" -> null
      - id                       = "bff-service-app-task" -> null
      - memory                   = "1024" -> null
      - network_mode             = "awsvpc" -> null
      - requires_compatibilities = [
          - "FARGATE",
        ] -> null
      - revision                 = 10 -> null
      - skip_destroy             = false -> null
      - tags                     = {} -> null
      - tags_all                 = {} -> null
    }

  # aws_ecs_task_definition.gtw_service_app will be destroyed
  # (because aws_ecs_task_definition.gtw_service_app is not in configuration)
  - resource "aws_ecs_task_definition" "gtw_service_app" {
      - arn                      = "arn:aws:ecs:eu-west-1:802288441694:task-definition/gtw-service-app-task:14" -> null
      - arn_without_revision     = "arn:aws:ecs:eu-west-1:802288441694:task-definition/gtw-service-app-task" -> null
      - container_definitions    = jsonencode(
            [
              - {
                  - cpu              = 512
                  - environment      = [
                      - {
                          - name  = "ASICS_AUTH_CLIENT_ID"
                          - value = "one_asics_be_staging"
                        },
                      - {
                          - name  = "ASICS_AUTH_CLIENT_SECRET"
                          - value = "testttttt"
                        },
                      - {
                          - name  = "ASICS_AUTH_INTROSPECT_ENDPOINT"
                          - value = "https://id-sandbox.asics.com/api/v2/introspect"
                        },
                      - {
                          - name  = "BFF_URL"
                          - value = "http://internal-bff-alb-1826596893.eu-west-1.elb.amazonaws.com"
                        },
                      - {
                          - name  = "CIRCUIT_BREAKER_FAILURE_RATE_THRESHOLD"
                          - value = "50"
                        },
                      - {
                          - name  = "CIRCUIT_BREAKER_PERMITTED_CALLS"
                          - value = "10"
                        },
                      - {
                          - name  = "CIRCUIT_BREAKER_SLIDING_WINDOW_SIZE"
                          - value = "100"
                        },
                      - {
                          - name  = "CIRCUIT_BREAKER_WAIT_DURATION"
                          - value = "10000"
                        },
                      - {
                          - name  = "RATE_LIMITER_BURST_CAPACITY"
                          - value = "20"
                        },
                      - {
                          - name  = "RATE_LIMITER_REPLENISH_RATE"
                          - value = "10"
                        },
                      - {
                          - name  = "REDIS_NODES"
                          - value = ""
                        },
                      - {
                          - name  = "REQUEST_SIZE"
                          - value = "2MB"
                        },
                      - {
                          - name  = "RETRY_COUNT"
                          - value = "3"
                        },
                      - {
                          - name  = "SPRING_PROFILES_ACTIVE"
                          - value = "dev"
                        },
                    ]
                  - essential        = true
                  - image            = "802288441694.dkr.ecr.eu-west-1.amazonaws.com/asics-gtw:latest"
                  - logConfiguration = {
                      - logDriver = "awslogs"
                      - options   = {
                          - awslogs-group         = "/ecs/gtw-service"
                          - awslogs-region        = "eu-west-1"
                          - awslogs-stream-prefix = "ecs"
                        }
                    }
                  - memory           = 1024
                  - mountPoints      = []
                  - name             = "gtw-service"
                  - portMappings     = [
                      - {
                          - containerPort = 8080
                          - hostPort      = 8080
                          - protocol      = "tcp"
                        },
                    ]
                  - systemControls   = []
                  - volumesFrom      = []
                },
            ]
        ) -> null
      - cpu                      = "512" -> null
      - execution_role_arn       = "arn:aws:iam::802288441694:role/ecs-execution-role" -> null
      - family                   = "gtw-service-app-task" -> null
      - id                       = "gtw-service-app-task" -> null
      - memory                   = "1024" -> null
      - network_mode             = "awsvpc" -> null
      - requires_compatibilities = [
          - "FARGATE",
        ] -> null
      - revision                 = 14 -> null
      - skip_destroy             = false -> null
      - tags                     = {} -> null
      - tags_all                 = {} -> null
    }

  # aws_elasticache_replication_group.redis will be updated in-place
  ~ resource "aws_elasticache_replication_group" "redis" {
        id                             = "my-redis-cluster"
      ~ security_group_ids             = [
          - "sg-0c9a22295813f5385",
        ] -> (known after apply)
        tags                           = {
            "Name" = "my-redis-cluster"
        }
        # (31 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # aws_elasticache_subnet_group.redis_subnet_group will be updated in-place
  ~ resource "aws_elasticache_subnet_group" "redis_subnet_group" {
        id          = "redis-subnet-group"
        name        = "redis-subnet-group"
      ~ subnet_ids  = [
          - "subnet-036a5e724b44fa8df",
          - "subnet-0a15b82f75b3300cd",
        ] -> (known after apply)
        tags        = {
            "Name" = "redis-subnet-group"
        }
        # (3 unchanged attributes hidden)
    }

  # aws_iam_role.codebuild_role will be destroyed
  # (because aws_iam_role.codebuild_role is not in configuration)
  - resource "aws_iam_role" "codebuild_role" {
      - arn                   = "arn:aws:iam::802288441694:role/codebuild-role" -> null
      - assume_role_policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRole"
                      - Effect    = "Allow"
                      - Principal = {
                          - Service = "codebuild.amazonaws.com"
                        }
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - create_date           = "2024-09-04T14:25:12Z" -> null
      - force_detach_policies = false -> null
      - id                    = "codebuild-role" -> null
      - managed_policy_arns   = [
          - "arn:aws:iam::aws:policy/AWSCodeBuildDeveloperAccess",
        ] -> null
      - max_session_duration  = 3600 -> null
      - name                  = "codebuild-role" -> null
      - path                  = "/" -> null
      - role_last_used        = [
          - {
              - last_used_date = "2024-09-05T10:40:47Z"
              - region         = "eu-west-1"
            },
        ] -> null
      - tags                  = {} -> null
      - tags_all              = {} -> null
      - unique_id             = "AROA3VTA6DFPDRF62LZMN" -> null

      - inline_policy {
          - name   = "terraform-20240905103713269500000001" -> null
          - policy = jsonencode(
                {
                  - Statement = [
                      - {
                          - Action   = [
                              - "logs:CreateLogGroup",
                              - "logs:CreateLogStream",
                              - "logs:PutLogEvents",
                              - "s3:PutObject",
                              - "s3:GetObject",
                              - "s3:GetObjectVersion",
                              - "s3:ListBucket",
                              - "codebuild:BatchGetBuilds",
                              - "codebuild:StartBuild",
                              - "codebuild:BatchGetProjects",
                              - "ec2:DescribeSubnets",
                              - "ec2:DescribeSecurityGroups",
                              - "ec2:DescribeVpcs",
                              - "ec2:CreateNetworkInterface",
                              - "ec2:DescribeNetworkInterfaces",
                              - "ec2:DeleteNetworkInterface",
                            ]
                          - Effect   = "Allow"
                          - Resource = "*"
                        },
                    ]
                  - Version   = "2012-10-17"
                }
            ) -> null
        }
    }

  # aws_iam_role.codedeploy_role will be destroyed
  # (because aws_iam_role.codedeploy_role is not in configuration)
  - resource "aws_iam_role" "codedeploy_role" {
      - arn                   = "arn:aws:iam::802288441694:role/codedeploy-role" -> null
      - assume_role_policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRole"
                      - Effect    = "Allow"
                      - Principal = {
                          - Service = "codedeploy.amazonaws.com"
                        }
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - create_date           = "2024-09-04T14:25:12Z" -> null
      - force_detach_policies = false -> null
      - id                    = "codedeploy-role" -> null
      - managed_policy_arns   = [
          - "arn:aws:iam::aws:policy/service-role/AWSCodeDeployRole",
        ] -> null
      - max_session_duration  = 3600 -> null
      - name                  = "codedeploy-role" -> null
      - path                  = "/" -> null
      - role_last_used        = [
          - {
              - last_used_date = ""
              - region         = ""
            },
        ] -> null
      - tags                  = {} -> null
      - tags_all              = {} -> null
      - unique_id             = "AROA3VTA6DFPLN5DCKLPG" -> null

      - inline_policy {
          - name   = "terraform-20240905103713269900000002" -> null
          - policy = jsonencode(
                {
                  - Statement = [
                      - {
                          - Action   = [
                              - "ecs:DescribeServices",
                              - "ecs:UpdateService",
                              - "ecs:DescribeTaskDefinition",
                              - "ecs:DescribeTasks",
                              - "ecs:ListTasks",
                              - "events:PutRule",
                              - "events:PutTargets",
                              - "events:DescribeRule",
                              - "lambda:InvokeFunction",
                              - "s3:GetObject",
                              - "s3:GetObjectVersion",
                              - "s3:GetBucketVersioning",
                              - "application-autoscaling:RegisterScalableTarget",
                              - "application-autoscaling:DeleteScalingPolicy",
                              - "application-autoscaling:DeregisterScalableTarget",
                              - "application-autoscaling:DescribeScalableTargets",
                              - "application-autoscaling:PutScalingPolicy",
                              - "application-autoscaling:DescribeScalingPolicies",
                              - "cloudwatch:DescribeAlarms",
                              - "cloudwatch:PutMetricAlarm",
                              - "cloudwatch:DeleteAlarms",
                            ]
                          - Effect   = "Allow"
                          - Resource = "*"
                        },
                    ]
                  - Version   = "2012-10-17"
                }
            ) -> null
        }
    }

  # aws_iam_role.codepipeline_role will be destroyed
  # (because aws_iam_role.codepipeline_role is not in configuration)
  - resource "aws_iam_role" "codepipeline_role" {
      - arn                   = "arn:aws:iam::802288441694:role/codepipeline-role" -> null
      - assume_role_policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRole"
                      - Effect    = "Allow"
                      - Principal = {
                          - Service = "codepipeline.amazonaws.com"
                        }
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - create_date           = "2024-09-04T14:25:12Z" -> null
      - force_detach_policies = false -> null
      - id                    = "codepipeline-role" -> null
      - managed_policy_arns   = [
          - "arn:aws:iam::aws:policy/AWSCodePipeline_FullAccess",
        ] -> null
      - max_session_duration  = 3600 -> null
      - name                  = "codepipeline-role" -> null
      - path                  = "/" -> null
      - role_last_used        = [
          - {
              - last_used_date = "2024-09-05T10:41:17Z"
              - region         = "eu-west-1"
            },
        ] -> null
      - tags                  = {} -> null
      - tags_all              = {} -> null
      - unique_id             = "AROA3VTA6DFPG3WSRA2RP" -> null

      - inline_policy {
          - name   = "terraform-20240904145455424300000001" -> null
          - policy = jsonencode(
                {
                  - Statement = [
                      - {
                          - Action   = [
                              - "codepipeline:*",
                              - "codebuild:BatchGetBuilds",
                              - "codebuild:StartBuild",
                              - "codebuild:BatchGetProjects",
                              - "codebuild:BatchGetBuildBatches",
                              - "codebuild:ListBuildsForProject",
                              - "codedeploy:RegisterApplicationRevision",
                              - "codedeploy:GetApplicationRevision",
                              - "codedeploy:GetDeploymentConfig",
                              - "codedeploy:CreateDeployment",
                              - "codedeploy:GetDeployment",
                              - "codedeploy:GetDeploymentGroup",
                              - "s3:PutObject",
                              - "s3:GetObject",
                              - "s3:GetObjectVersion",
                              - "s3:GetBucketVersioning",
                              - "s3:PutBucketVersioning",
                              - "s3:PutBucketAcl",
                              - "s3:GetBucketAcl",
                              - "cloudwatch:*",
                              - "codestar-connections:UseConnection",
                              - "iam:PassRole",
                              - "lambda:InvokeFunction",
                              - "lambda:GetFunctionConfiguration",
                            ]
                          - Effect   = "Allow"
                          - Resource = "*"
                        },
                    ]
                  - Version   = "2012-10-17"
                }
            ) -> null
        }
    }

  # aws_iam_role.ecs_auto_scale_role will be destroyed
  # (because aws_iam_role.ecs_auto_scale_role is not in configuration)
  - resource "aws_iam_role" "ecs_auto_scale_role" {
      - arn                   = "arn:aws:iam::802288441694:role/EcsAutoScaleRole" -> null
      - assume_role_policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRole"
                      - Effect    = "Allow"
                      - Principal = {
                          - Service = "application-autoscaling.amazonaws.com"
                        }
                      - Sid       = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - create_date           = "2024-08-19T19:55:25Z" -> null
      - force_detach_policies = false -> null
      - id                    = "EcsAutoScaleRole" -> null
      - managed_policy_arns   = [
          - "arn:aws:iam::aws:policy/service-role/AmazonEC2ContainerServiceAutoscaleRole",
        ] -> null
      - max_session_duration  = 3600 -> null
      - name                  = "EcsAutoScaleRole" -> null
      - path                  = "/" -> null
      - role_last_used        = [
          - {
              - last_used_date = ""
              - region         = ""
            },
        ] -> null
      - tags                  = {} -> null
      - tags_all              = {} -> null
      - unique_id             = "AROA3VTA6DFPIUT5UV2YD" -> null
    }

  # aws_iam_role.ecs_task_execution_role will be destroyed
  # (because aws_iam_role.ecs_task_execution_role is not in configuration)
  - resource "aws_iam_role" "ecs_task_execution_role" {
      - arn                   = "arn:aws:iam::802288441694:role/ecs-execution-role" -> null
      - assume_role_policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRole"
                      - Effect    = "Allow"
                      - Principal = {
                          - Service = "ecs-tasks.amazonaws.com"
                        }
                      - Sid       = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - create_date           = "2024-08-19T08:15:17Z" -> null
      - force_detach_policies = false -> null
      - id                    = "ecs-execution-role" -> null
      - managed_policy_arns   = [
          - "arn:aws:iam::aws:policy/service-role/AmazonECSTaskExecutionRolePolicy",
        ] -> null
      - max_session_duration  = 3600 -> null
      - name                  = "ecs-execution-role" -> null
      - path                  = "/" -> null
      - role_last_used        = [
          - {
              - last_used_date = "2024-09-05T11:13:37Z"
              - region         = "eu-west-1"
            },
        ] -> null
      - tags                  = {} -> null
      - tags_all              = {} -> null
      - unique_id             = "AROA3VTA6DFPN4HLHW7EA" -> null
    }

  # aws_iam_role.ecs_task_role will be destroyed
  # (because aws_iam_role.ecs_task_role is not in configuration)
  - resource "aws_iam_role" "ecs_task_role" {
      - arn                   = "arn:aws:iam::802288441694:role/ecs-task-role" -> null
      - assume_role_policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRole"
                      - Effect    = "Allow"
                      - Principal = {
                          - Service = "ecs-tasks.amazonaws.com"
                        }
                      - Sid       = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - create_date           = "2024-08-19T08:15:17Z" -> null
      - force_detach_policies = false -> null
      - id                    = "ecs-task-role" -> null
      - managed_policy_arns   = [
          - "arn:aws:iam::aws:policy/AmazonS3FullAccess",
        ] -> null
      - max_session_duration  = 3600 -> null
      - name                  = "ecs-task-role" -> null
      - path                  = "/" -> null
      - role_last_used        = [
          - {
              - last_used_date = ""
              - region         = ""
            },
        ] -> null
      - tags                  = {} -> null
      - tags_all              = {} -> null
      - unique_id             = "AROA3VTA6DFPANV6TMCBY" -> null
    }

  # aws_iam_role_policy.codebuild_service_role_policy will be destroyed
  # (because aws_iam_role_policy.codebuild_service_role_policy is not in configuration)
  - resource "aws_iam_role_policy" "codebuild_service_role_policy" {
      - id     = "codebuild-role:terraform-20240905103713269500000001" -> null
      - name   = "terraform-20240905103713269500000001" -> null
      - policy = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "logs:CreateLogGroup",
                          - "logs:CreateLogStream",
                          - "logs:PutLogEvents",
                          - "s3:PutObject",
                          - "s3:GetObject",
                          - "s3:GetObjectVersion",
                          - "s3:ListBucket",
                          - "codebuild:BatchGetBuilds",
                          - "codebuild:StartBuild",
                          - "codebuild:BatchGetProjects",
                          - "ec2:DescribeSubnets",
                          - "ec2:DescribeSecurityGroups",
                          - "ec2:DescribeVpcs",
                          - "ec2:CreateNetworkInterface",
                          - "ec2:DescribeNetworkInterfaces",
                          - "ec2:DeleteNetworkInterface",
                        ]
                      - Effect   = "Allow"
                      - Resource = "*"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - role   = "codebuild-role" -> null
    }

  # aws_iam_role_policy.codedeploy_service_role_policy will be destroyed
  # (because aws_iam_role_policy.codedeploy_service_role_policy is not in configuration)
  - resource "aws_iam_role_policy" "codedeploy_service_role_policy" {
      - id     = "codedeploy-role:terraform-20240905103713269900000002" -> null
      - name   = "terraform-20240905103713269900000002" -> null
      - policy = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "ecs:DescribeServices",
                          - "ecs:UpdateService",
                          - "ecs:DescribeTaskDefinition",
                          - "ecs:DescribeTasks",
                          - "ecs:ListTasks",
                          - "events:PutRule",
                          - "events:PutTargets",
                          - "events:DescribeRule",
                          - "lambda:InvokeFunction",
                          - "s3:GetObject",
                          - "s3:GetObjectVersion",
                          - "s3:GetBucketVersioning",
                          - "application-autoscaling:RegisterScalableTarget",
                          - "application-autoscaling:DeleteScalingPolicy",
                          - "application-autoscaling:DeregisterScalableTarget",
                          - "application-autoscaling:DescribeScalableTargets",
                          - "application-autoscaling:PutScalingPolicy",
                          - "application-autoscaling:DescribeScalingPolicies",
                          - "cloudwatch:DescribeAlarms",
                          - "cloudwatch:PutMetricAlarm",
                          - "cloudwatch:DeleteAlarms",
                        ]
                      - Effect   = "Allow"
                      - Resource = "*"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - role   = "codedeploy-role" -> null
    }

  # aws_iam_role_policy.codepipeline_service_role_policy will be destroyed
  # (because aws_iam_role_policy.codepipeline_service_role_policy is not in configuration)
  - resource "aws_iam_role_policy" "codepipeline_service_role_policy" {
      - id     = "codepipeline-role:terraform-20240904145455424300000001" -> null
      - name   = "terraform-20240904145455424300000001" -> null
      - policy = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "codepipeline:*",
                          - "codebuild:BatchGetBuilds",
                          - "codebuild:StartBuild",
                          - "codebuild:BatchGetProjects",
                          - "codebuild:BatchGetBuildBatches",
                          - "codebuild:ListBuildsForProject",
                          - "codedeploy:RegisterApplicationRevision",
                          - "codedeploy:GetApplicationRevision",
                          - "codedeploy:GetDeploymentConfig",
                          - "codedeploy:CreateDeployment",
                          - "codedeploy:GetDeployment",
                          - "codedeploy:GetDeploymentGroup",
                          - "s3:PutObject",
                          - "s3:GetObject",
                          - "s3:GetObjectVersion",
                          - "s3:GetBucketVersioning",
                          - "s3:PutBucketVersioning",
                          - "s3:PutBucketAcl",
                          - "s3:GetBucketAcl",
                          - "cloudwatch:*",
                          - "codestar-connections:UseConnection",
                          - "iam:PassRole",
                          - "lambda:InvokeFunction",
                          - "lambda:GetFunctionConfiguration",
                        ]
                      - Effect   = "Allow"
                      - Resource = "*"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - role   = "codepipeline-role" -> null
    }

  # aws_iam_role_policy_attachment.codebuild_attach will be destroyed
  # (because aws_iam_role_policy_attachment.codebuild_attach is not in configuration)
  - resource "aws_iam_role_policy_attachment" "codebuild_attach" {
      - id         = "codebuild-role-20240904142512940700000002" -> null
      - policy_arn = "arn:aws:iam::aws:policy/AWSCodeBuildDeveloperAccess" -> null
      - role       = "codebuild-role" -> null
    }

  # aws_iam_role_policy_attachment.codedeploy_attach will be destroyed
  # (because aws_iam_role_policy_attachment.codedeploy_attach is not in configuration)
  - resource "aws_iam_role_policy_attachment" "codedeploy_attach" {
      - id         = "codedeploy-role-20240904142512929600000001" -> null
      - policy_arn = "arn:aws:iam::aws:policy/service-role/AWSCodeDeployRole" -> null
      - role       = "codedeploy-role" -> null
    }

  # aws_iam_role_policy_attachment.codepipeline_attach will be destroyed
  # (because aws_iam_role_policy_attachment.codepipeline_attach is not in configuration)
  - resource "aws_iam_role_policy_attachment" "codepipeline_attach" {
      - id         = "codepipeline-role-20240904144125435300000001" -> null
      - policy_arn = "arn:aws:iam::aws:policy/AWSCodePipeline_FullAccess" -> null
      - role       = "codepipeline-role" -> null
    }

  # aws_iam_role_policy_attachment.ecs-task-execution-role-policy-attachment will be destroyed
  # (because aws_iam_role_policy_attachment.ecs-task-execution-role-policy-attachment is not in configuration)
  - resource "aws_iam_role_policy_attachment" "ecs-task-execution-role-policy-attachment" {
      - id         = "ecs-execution-role-20240819081518024600000002" -> null
      - policy_arn = "arn:aws:iam::aws:policy/service-role/AmazonECSTaskExecutionRolePolicy" -> null
      - role       = "ecs-execution-role" -> null
    }

  # aws_iam_role_policy_attachment.ecs_auto_scale_role will be destroyed
  # (because aws_iam_role_policy_attachment.ecs_auto_scale_role is not in configuration)
  - resource "aws_iam_role_policy_attachment" "ecs_auto_scale_role" {
      - id         = "EcsAutoScaleRole-20240819195525719600000001" -> null
      - policy_arn = "arn:aws:iam::aws:policy/service-role/AmazonEC2ContainerServiceAutoscaleRole" -> null
      - role       = "EcsAutoScaleRole" -> null
    }

  # aws_iam_role_policy_attachment.task_s3 will be destroyed
  # (because aws_iam_role_policy_attachment.task_s3 is not in configuration)
  - resource "aws_iam_role_policy_attachment" "task_s3" {
      - id         = "ecs-task-role-20240819081517975400000001" -> null
      - policy_arn = "arn:aws:iam::aws:policy/AmazonS3FullAccess" -> null
      - role       = "ecs-task-role" -> null
    }

  # aws_internet_gateway.gw will be destroyed
  # (because aws_internet_gateway.gw is not in configuration)
  - resource "aws_internet_gateway" "gw" {
      - arn      = "arn:aws:ec2:eu-west-1:802288441694:internet-gateway/igw-0fb286c9a49c0be0d" -> null
      - id       = "igw-0fb286c9a49c0be0d" -> null
      - owner_id = "802288441694" -> null
      - tags     = {} -> null
      - tags_all = {} -> null
      - vpc_id   = "vpc-034dd95974f394745" -> null
    }

  # aws_lb.bff_alb will be destroyed
  # (because aws_lb.bff_alb is not in configuration)
  - resource "aws_lb" "bff_alb" {
      - arn                                         = "arn:aws:elasticloadbalancing:eu-west-1:802288441694:loadbalancer/app/bff-alb/5aa868ff550d2701" -> null
      - arn_suffix                                  = "app/bff-alb/5aa868ff550d2701" -> null
      - desync_mitigation_mode                      = "defensive" -> null
      - dns_name                                    = "internal-bff-alb-1826596893.eu-west-1.elb.amazonaws.com" -> null
      - drop_invalid_header_fields                  = false -> null
      - enable_cross_zone_load_balancing            = true -> null
      - enable_deletion_protection                  = false -> null
      - enable_http2                                = true -> null
      - enable_tls_version_and_cipher_suite_headers = false -> null
      - enable_waf_fail_open                        = false -> null
      - enable_xff_client_port                      = false -> null
      - id                                          = "arn:aws:elasticloadbalancing:eu-west-1:802288441694:loadbalancer/app/bff-alb/5aa868ff550d2701" -> null
      - idle_timeout                                = 60 -> null
      - internal                                    = true -> null
      - ip_address_type                             = "ipv4" -> null
      - load_balancer_type                          = "application" -> null
      - name                                        = "bff-alb" -> null
      - preserve_host_header                        = false -> null
      - security_groups                             = [
          - "sg-05b6da332a709d6c8",
        ] -> null
      - subnets                                     = [
          - "subnet-036a5e724b44fa8df",
          - "subnet-0a15b82f75b3300cd",
        ] -> null
      - tags                                        = {} -> null
      - tags_all                                    = {} -> null
      - vpc_id                                      = "vpc-034dd95974f394745" -> null
      - xff_header_processing_mode                  = "append" -> null
      - zone_id                                     = "Z32O12XQLNTSW2" -> null

      - access_logs {
          - enabled = false -> null
        }

      - subnet_mapping {
          - subnet_id = "subnet-036a5e724b44fa8df" -> null
        }
      - subnet_mapping {
          - subnet_id = "subnet-0a15b82f75b3300cd" -> null
        }
    }

  # aws_lb.gtw_alb will be destroyed
  # (because aws_lb.gtw_alb is not in configuration)
  - resource "aws_lb" "gtw_alb" {
      - arn                                         = "arn:aws:elasticloadbalancing:eu-west-1:802288441694:loadbalancer/app/gtw-alb/1504e27b1a9387be" -> null
      - arn_suffix                                  = "app/gtw-alb/1504e27b1a9387be" -> null
      - desync_mitigation_mode                      = "defensive" -> null
      - dns_name                                    = "gtw-alb-1867142397.eu-west-1.elb.amazonaws.com" -> null
      - drop_invalid_header_fields                  = false -> null
      - enable_cross_zone_load_balancing            = true -> null
      - enable_deletion_protection                  = false -> null
      - enable_http2                                = true -> null
      - enable_tls_version_and_cipher_suite_headers = false -> null
      - enable_waf_fail_open                        = false -> null
      - enable_xff_client_port                      = false -> null
      - id                                          = "arn:aws:elasticloadbalancing:eu-west-1:802288441694:loadbalancer/app/gtw-alb/1504e27b1a9387be" -> null
      - idle_timeout                                = 60 -> null
      - internal                                    = false -> null
      - ip_address_type                             = "ipv4" -> null
      - load_balancer_type                          = "application" -> null
      - name                                        = "gtw-alb" -> null
      - preserve_host_header                        = false -> null
      - security_groups                             = [
          - "sg-0ddc9f6d8fb60802e",
        ] -> null
      - subnets                                     = [
          - "subnet-048eedd36dc7ac201",
          - "subnet-0fe80fa5495cb3632",
        ] -> null
      - tags                                        = {} -> null
      - tags_all                                    = {} -> null
      - vpc_id                                      = "vpc-034dd95974f394745" -> null
      - xff_header_processing_mode                  = "append" -> null
      - zone_id                                     = "Z32O12XQLNTSW2" -> null

      - access_logs {
          - enabled = false -> null
        }

      - subnet_mapping {
          - subnet_id = "subnet-048eedd36dc7ac201" -> null
        }
      - subnet_mapping {
          - subnet_id = "subnet-0fe80fa5495cb3632" -> null
        }
    }

  # aws_lb_listener.dev_listener will be destroyed
  # (because aws_lb_listener.dev_listener is not in configuration)
  - resource "aws_lb_listener" "dev_listener" {
      - arn               = "arn:aws:elasticloadbalancing:eu-west-1:802288441694:listener/app/bff-alb/5aa868ff550d2701/ce2ba0c83e75b924" -> null
      - id                = "arn:aws:elasticloadbalancing:eu-west-1:802288441694:listener/app/bff-alb/5aa868ff550d2701/ce2ba0c83e75b924" -> null
      - load_balancer_arn = "arn:aws:elasticloadbalancing:eu-west-1:802288441694:loadbalancer/app/bff-alb/5aa868ff550d2701" -> null
      - port              = 80 -> null
      - protocol          = "HTTP" -> null
      - tags              = {} -> null
      - tags_all          = {} -> null

      - default_action {
          - order            = 1 -> null
          - target_group_arn = "arn:aws:elasticloadbalancing:eu-west-1:802288441694:targetgroup/bff-service-tg/0d4dcd8f3e55c5db" -> null
          - type             = "forward" -> null
        }
    }

  # aws_lb_listener.gtw_listener will be destroyed
  # (because aws_lb_listener.gtw_listener is not in configuration)
  - resource "aws_lb_listener" "gtw_listener" {
      - arn               = "arn:aws:elasticloadbalancing:eu-west-1:802288441694:listener/app/gtw-alb/1504e27b1a9387be/8e7e051be87c920e" -> null
      - id                = "arn:aws:elasticloadbalancing:eu-west-1:802288441694:listener/app/gtw-alb/1504e27b1a9387be/8e7e051be87c920e" -> null
      - load_balancer_arn = "arn:aws:elasticloadbalancing:eu-west-1:802288441694:loadbalancer/app/gtw-alb/1504e27b1a9387be" -> null
      - port              = 80 -> null
      - protocol          = "HTTP" -> null
      - tags              = {} -> null
      - tags_all          = {} -> null

      - default_action {
          - order            = 1 -> null
          - target_group_arn = "arn:aws:elasticloadbalancing:eu-west-1:802288441694:targetgroup/gtw-service-tg/c69fd0aeab02a1e0" -> null
          - type             = "forward" -> null
        }
    }

  # aws_lb_target_group.bff_service_blue_tg will be destroyed
  # (because aws_lb_target_group.bff_service_blue_tg is not in configuration)
  - resource "aws_lb_target_group" "bff_service_blue_tg" {
      - arn                                = "arn:aws:elasticloadbalancing:eu-west-1:802288441694:targetgroup/bff-service-tg/0d4dcd8f3e55c5db" -> null
      - arn_suffix                         = "targetgroup/bff-service-tg/0d4dcd8f3e55c5db" -> null
      - connection_termination             = false -> null
      - deregistration_delay               = "300" -> null
      - id                                 = "arn:aws:elasticloadbalancing:eu-west-1:802288441694:targetgroup/bff-service-tg/0d4dcd8f3e55c5db" -> null
      - ip_address_type                    = "ipv4" -> null
      - lambda_multi_value_headers_enabled = false -> null
      - load_balancing_algorithm_type      = "round_robin" -> null
      - load_balancing_cross_zone_enabled  = "use_load_balancer_configuration" -> null
      - name                               = "bff-service-tg" -> null
      - port                               = 8081 -> null
      - protocol                           = "HTTP" -> null
      - protocol_version                   = "HTTP1" -> null
      - proxy_protocol_v2                  = false -> null
      - slow_start                         = 0 -> null
      - tags                               = {} -> null
      - tags_all                           = {} -> null
      - target_type                        = "ip" -> null
      - vpc_id                             = "vpc-034dd95974f394745" -> null

      - health_check {
          - enabled             = true -> null
          - healthy_threshold   = 2 -> null
          - interval            = 60 -> null
          - matcher             = "200" -> null
          - path                = "/health" -> null
          - port                = "traffic-port" -> null
          - protocol            = "HTTP" -> null
          - timeout             = 30 -> null
          - unhealthy_threshold = 2 -> null
        }

      - stickiness {
          - cookie_duration = 86400 -> null
          - enabled         = false -> null
          - type            = "lb_cookie" -> null
        }

      - target_failover {}
    }

  # aws_lb_target_group.gtw_service_blue_tg will be destroyed
  # (because aws_lb_target_group.gtw_service_blue_tg is not in configuration)
  - resource "aws_lb_target_group" "gtw_service_blue_tg" {
      - arn                                = "arn:aws:elasticloadbalancing:eu-west-1:802288441694:targetgroup/gtw-service-tg/c69fd0aeab02a1e0" -> null
      - arn_suffix                         = "targetgroup/gtw-service-tg/c69fd0aeab02a1e0" -> null
      - connection_termination             = false -> null
      - deregistration_delay               = "300" -> null
      - id                                 = "arn:aws:elasticloadbalancing:eu-west-1:802288441694:targetgroup/gtw-service-tg/c69fd0aeab02a1e0" -> null
      - ip_address_type                    = "ipv4" -> null
      - lambda_multi_value_headers_enabled = false -> null
      - load_balancing_algorithm_type      = "round_robin" -> null
      - load_balancing_cross_zone_enabled  = "use_load_balancer_configuration" -> null
      - name                               = "gtw-service-tg" -> null
      - port                               = 8080 -> null
      - protocol                           = "HTTP" -> null
      - protocol_version                   = "HTTP1" -> null
      - proxy_protocol_v2                  = false -> null
      - slow_start                         = 0 -> null
      - tags                               = {} -> null
      - tags_all                           = {} -> null
      - target_type                        = "ip" -> null
      - vpc_id                             = "vpc-034dd95974f394745" -> null

      - health_check {
          - enabled             = true -> null
          - healthy_threshold   = 2 -> null
          - interval            = 60 -> null
          - matcher             = "200" -> null
          - path                = "/health" -> null
          - port                = "traffic-port" -> null
          - protocol            = "HTTP" -> null
          - timeout             = 30 -> null
          - unhealthy_threshold = 2 -> null
        }

      - stickiness {
          - cookie_duration = 86400 -> null
          - enabled         = false -> null
          - type            = "lb_cookie" -> null
        }

      - target_failover {}
    }

  # aws_route.internet_access will be destroyed
  # (because aws_route.internet_access is not in configuration)
  - resource "aws_route" "internet_access" {
      - destination_cidr_block = "0.0.0.0/0" -> null
      - gateway_id             = "igw-0fb286c9a49c0be0d" -> null
      - id                     = "r-rtb-026c0f34bf1cafc1e1080289494" -> null
      - origin                 = "CreateRoute" -> null
      - route_table_id         = "rtb-026c0f34bf1cafc1e" -> null
      - state                  = "active" -> null
    }

  # aws_security_group.ecs_tasks must be replaced
-/+ resource "aws_security_group" "ecs_tasks" {
      ~ arn                    = "arn:aws:ec2:eu-west-1:802288441694:security-group/sg-06e777883e1f5464b" -> (known after apply)
      ~ egress                 = [
          + {
              + cidr_blocks      = []
              + description      = "Allow traffic to Redis"
              + from_port        = 6379
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 6379
            },
            # (1 unchanged element hidden)
        ]
      ~ id                     = "sg-06e777883e1f5464b" -> (known after apply)
      ~ ingress                = [
          - {
              - cidr_blocks      = []
              - description      = ""
              - from_port        = 8081
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = [
                  - "sg-05b6da332a709d6c8",
                ]
              - self             = false
              - to_port          = 8081
            },
          + {
              + cidr_blocks      = []
              + description      = ""
              + from_port        = 8081
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = (known after apply)
              + self             = false
              + to_port          = 8081
            },
        ]
        name                   = "cb-ecs-tasks-security-group"
      + name_prefix            = (known after apply)
      ~ owner_id               = "802288441694" -> (known after apply)
      - tags                   = {} -> null
      ~ tags_all               = {} -> (known after apply)
      ~ vpc_id                 = "vpc-034dd95974f394745" # forces replacement -> (known after apply) # forces replacement
        # (2 unchanged attributes hidden)
    }

  # aws_security_group.gtw_ecs_tasks must be replaced
-/+ resource "aws_security_group" "gtw_ecs_tasks" {
      ~ arn                    = "arn:aws:ec2:eu-west-1:802288441694:security-group/sg-0f505df8b5227d2be" -> (known after apply)
      ~ egress                 = [
          + {
              + cidr_blocks      = []
              + description      = "Allow traffic to Redis"
              + from_port        = 6379
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 6379
            },
            # (2 unchanged elements hidden)
        ]
      ~ id                     = "sg-0f505df8b5227d2be" -> (known after apply)
      ~ ingress                = [
          - {
              - cidr_blocks      = []
              - description      = ""
              - from_port        = 8080
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = [
                  - "sg-0ddc9f6d8fb60802e",
                ]
              - self             = false
              - to_port          = 8080
            },
          - {
              - cidr_blocks      = []
              - description      = ""
              - from_port        = 80
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = [
                  - "sg-0ddc9f6d8fb60802e",
                ]
              - self             = false
              - to_port          = 80
            },
          + {
              + cidr_blocks      = []
              + description      = ""
              + from_port        = 8080
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = (known after apply)
              + self             = false
              + to_port          = 8080
            },
          + {
              + cidr_blocks      = []
              + description      = ""
              + from_port        = 80
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = (known after apply)
              + self             = false
              + to_port          = 80
            },
        ]
        name                   = "gtw-ecs-tasks-security-group"
      + name_prefix            = (known after apply)
      ~ owner_id               = "802288441694" -> (known after apply)
      - tags                   = {} -> null
      ~ tags_all               = {} -> (known after apply)
      ~ vpc_id                 = "vpc-034dd95974f394745" # forces replacement -> (known after apply) # forces replacement
        # (2 unchanged attributes hidden)
    }

  # aws_security_group.gtw_lb must be replaced
-/+ resource "aws_security_group" "gtw_lb" {
      ~ arn                    = "arn:aws:ec2:eu-west-1:802288441694:security-group/sg-0ddc9f6d8fb60802e" -> (known after apply)
      ~ id                     = "sg-0ddc9f6d8fb60802e" -> (known after apply)
        name                   = "gtw-load-balancer-security-group"
      + name_prefix            = (known after apply)
      ~ owner_id               = "802288441694" -> (known after apply)
      - tags                   = {} -> null
      ~ tags_all               = {} -> (known after apply)
      ~ vpc_id                 = "vpc-034dd95974f394745" # forces replacement -> (known after apply) # forces replacement
        # (4 unchanged attributes hidden)
    }

  # aws_security_group.lb must be replaced
-/+ resource "aws_security_group" "lb" {
      ~ arn                    = "arn:aws:ec2:eu-west-1:802288441694:security-group/sg-05b6da332a709d6c8" -> (known after apply)
      ~ id                     = "sg-05b6da332a709d6c8" -> (known after apply)
      ~ ingress                = [
          - {
              - cidr_blocks      = []
              - description      = ""
              - from_port        = 80
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = [
                  - "sg-0f505df8b5227d2be",
                ]
              - self             = false
              - to_port          = 80
            },
          + {
              + cidr_blocks      = []
              + description      = ""
              + from_port        = 80
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = (known after apply)
              + self             = false
              + to_port          = 80
            },
        ]
        name                   = "cb-load-balancer-security-group"
      + name_prefix            = (known after apply)
      ~ owner_id               = "802288441694" -> (known after apply)
      - tags                   = {} -> null
      ~ tags_all               = {} -> (known after apply)
      ~ vpc_id                 = "vpc-034dd95974f394745" # forces replacement -> (known after apply) # forces replacement
        # (3 unchanged attributes hidden)
    }

  # aws_security_group.redis_sg must be replaced
-/+ resource "aws_security_group" "redis_sg" {
      ~ arn                    = "arn:aws:ec2:eu-west-1:802288441694:security-group/sg-0c9a22295813f5385" -> (known after apply)
      ~ id                     = "sg-0c9a22295813f5385" -> (known after apply)
      ~ ingress                = [
          - {
              - cidr_blocks      = []
              - description      = "Allow ECS service access to Redis"
              - from_port        = 6379
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = [
                  - "sg-06e777883e1f5464b",
                ]
              - self             = false
              - to_port          = 6379
            },
          - {
              - cidr_blocks      = []
              - description      = "Allow ECS service access to Redis"
              - from_port        = 6379
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = [
                  - "sg-0f505df8b5227d2be",
                ]
              - self             = false
              - to_port          = 6379
            },
          + {
              + cidr_blocks      = []
              + description      = "Allow ECS service access to Redis"
              + from_port        = 6379
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = (known after apply)
              + self             = false
              + to_port          = 6379
            },
          + {
              + cidr_blocks      = []
              + description      = "Allow ECS service access to Redis"
              + from_port        = 6379
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = (known after apply)
              + self             = false
              + to_port          = 6379
            },
        ]
        name                   = "redis-sg"
      + name_prefix            = (known after apply)
      ~ owner_id               = "802288441694" -> (known after apply)
        tags                   = {
            "Name" = "redis-sg"
        }
      ~ vpc_id                 = "vpc-034dd95974f394745" # forces replacement -> (known after apply) # forces replacement
        # (4 unchanged attributes hidden)
    }

  # aws_subnet.private[0] will be destroyed
  # (because aws_subnet.private is not in configuration)
  - resource "aws_subnet" "private" {
      - arn                                            = "arn:aws:ec2:eu-west-1:802288441694:subnet/subnet-036a5e724b44fa8df" -> null
      - assign_ipv6_address_on_creation                = false -> null
      - availability_zone                              = "eu-west-1a" -> null
      - availability_zone_id                           = "euw1-az3" -> null
      - cidr_block                                     = "172.17.0.0/24" -> null
      - enable_dns64                                   = false -> null
      - enable_lni_at_device_index                     = 0 -> null
      - enable_resource_name_dns_a_record_on_launch    = false -> null
      - enable_resource_name_dns_aaaa_record_on_launch = false -> null
      - id                                             = "subnet-036a5e724b44fa8df" -> null
      - ipv6_native                                    = false -> null
      - map_customer_owned_ip_on_launch                = false -> null
      - map_public_ip_on_launch                        = false -> null
      - owner_id                                       = "802288441694" -> null
      - private_dns_hostname_type_on_launch            = "ip-name" -> null
      - tags                                           = {} -> null
      - tags_all                                       = {} -> null
      - vpc_id                                         = "vpc-034dd95974f394745" -> null
    }

  # aws_subnet.private[1] will be destroyed
  # (because aws_subnet.private is not in configuration)
  - resource "aws_subnet" "private" {
      - arn                                            = "arn:aws:ec2:eu-west-1:802288441694:subnet/subnet-0a15b82f75b3300cd" -> null
      - assign_ipv6_address_on_creation                = false -> null
      - availability_zone                              = "eu-west-1b" -> null
      - availability_zone_id                           = "euw1-az1" -> null
      - cidr_block                                     = "172.17.1.0/24" -> null
      - enable_dns64                                   = false -> null
      - enable_lni_at_device_index                     = 0 -> null
      - enable_resource_name_dns_a_record_on_launch    = false -> null
      - enable_resource_name_dns_aaaa_record_on_launch = false -> null
      - id                                             = "subnet-0a15b82f75b3300cd" -> null
      - ipv6_native                                    = false -> null
      - map_customer_owned_ip_on_launch                = false -> null
      - map_public_ip_on_launch                        = false -> null
      - owner_id                                       = "802288441694" -> null
      - private_dns_hostname_type_on_launch            = "ip-name" -> null
      - tags                                           = {} -> null
      - tags_all                                       = {} -> null
      - vpc_id                                         = "vpc-034dd95974f394745" -> null
    }

  # aws_subnet.public[0] will be destroyed
  # (because aws_subnet.public is not in configuration)
  - resource "aws_subnet" "public" {
      - arn                                            = "arn:aws:ec2:eu-west-1:802288441694:subnet/subnet-048eedd36dc7ac201" -> null
      - assign_ipv6_address_on_creation                = false -> null
      - availability_zone                              = "eu-west-1a" -> null
      - availability_zone_id                           = "euw1-az3" -> null
      - cidr_block                                     = "172.17.2.0/24" -> null
      - enable_dns64                                   = false -> null
      - enable_lni_at_device_index                     = 0 -> null
      - enable_resource_name_dns_a_record_on_launch    = false -> null
      - enable_resource_name_dns_aaaa_record_on_launch = false -> null
      - id                                             = "subnet-048eedd36dc7ac201" -> null
      - ipv6_native                                    = false -> null
      - map_customer_owned_ip_on_launch                = false -> null
      - map_public_ip_on_launch                        = true -> null
      - owner_id                                       = "802288441694" -> null
      - private_dns_hostname_type_on_launch            = "ip-name" -> null
      - tags                                           = {} -> null
      - tags_all                                       = {} -> null
      - vpc_id                                         = "vpc-034dd95974f394745" -> null
    }

  # aws_subnet.public[1] will be destroyed
  # (because aws_subnet.public is not in configuration)
  - resource "aws_subnet" "public" {
      - arn                                            = "arn:aws:ec2:eu-west-1:802288441694:subnet/subnet-0fe80fa5495cb3632" -> null
      - assign_ipv6_address_on_creation                = false -> null
      - availability_zone                              = "eu-west-1b" -> null
      - availability_zone_id                           = "euw1-az1" -> null
      - cidr_block                                     = "172.17.3.0/24" -> null
      - enable_dns64                                   = false -> null
      - enable_lni_at_device_index                     = 0 -> null
      - enable_resource_name_dns_a_record_on_launch    = false -> null
      - enable_resource_name_dns_aaaa_record_on_launch = false -> null
      - id                                             = "subnet-0fe80fa5495cb3632" -> null
      - ipv6_native                                    = false -> null
      - map_customer_owned_ip_on_launch                = false -> null
      - map_public_ip_on_launch                        = true -> null
      - owner_id                                       = "802288441694" -> null
      - private_dns_hostname_type_on_launch            = "ip-name" -> null
      - tags                                           = {} -> null
      - tags_all                                       = {} -> null
      - vpc_id                                         = "vpc-034dd95974f394745" -> null
    }

  # aws_vpc.main will be destroyed
  # (because aws_vpc.main is not in configuration)
  - resource "aws_vpc" "main" {
      - arn                                  = "arn:aws:ec2:eu-west-1:802288441694:vpc/vpc-034dd95974f394745" -> null
      - assign_generated_ipv6_cidr_block     = false -> null
      - cidr_block                           = "172.17.0.0/16" -> null
      - default_network_acl_id               = "acl-04585f5f224b98334" -> null
      - default_route_table_id               = "rtb-026c0f34bf1cafc1e" -> null
      - default_security_group_id            = "sg-0f6218e7dc99c7303" -> null
      - dhcp_options_id                      = "dopt-3984de5f" -> null
      - enable_classiclink                   = false -> null
      - enable_classiclink_dns_support       = false -> null
      - enable_dns_hostnames                 = false -> null
      - enable_dns_support                   = true -> null
      - enable_network_address_usage_metrics = false -> null
      - id                                   = "vpc-034dd95974f394745" -> null
      - instance_tenancy                     = "default" -> null
      - ipv6_netmask_length                  = 0 -> null
      - main_route_table_id                  = "rtb-026c0f34bf1cafc1e" -> null
      - owner_id                             = "802288441694" -> null
      - tags                                 = {} -> null
      - tags_all                             = {} -> null
    }

  # module.asics_cluster.aws_ecs_cluster.cluster will be created
  + resource "aws_ecs_cluster" "cluster" {
      + arn                = (known after apply)
      + capacity_providers = (known after apply)
      + id                 = (known after apply)
      + name               = "asics_cluster"
      + tags_all           = (known after apply)
    }

  # module.bff_alb.aws_lb.alb will be created
  + resource "aws_lb" "alb" {
      + arn                                         = (known after apply)
      + arn_suffix                                  = (known after apply)
      + desync_mitigation_mode                      = "defensive"
      + dns_name                                    = (known after apply)
      + drop_invalid_header_fields                  = false
      + enable_deletion_protection                  = false
      + enable_http2                                = true
      + enable_tls_version_and_cipher_suite_headers = false
      + enable_waf_fail_open                        = false
      + enable_xff_client_port                      = false
      + id                                          = (known after apply)
      + idle_timeout                                = 60
      + internal                                    = true
      + ip_address_type                             = (known after apply)
      + load_balancer_type                          = "application"
      + name                                        = "bff-alb"
      + preserve_host_header                        = false
      + security_groups                             = (known after apply)
      + subnets                                     = (known after apply)
      + tags_all                                    = (known after apply)
      + vpc_id                                      = (known after apply)
      + xff_header_processing_mode                  = "append"
      + zone_id                                     = (known after apply)
    }

  # module.bff_alb.aws_lb_listener.listener will be created
  + resource "aws_lb_listener" "listener" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + load_balancer_arn = (known after apply)
      + port              = 80
      + protocol          = "HTTP"
      + ssl_policy        = (known after apply)
      + tags_all          = (known after apply)

      + default_action {
          + order            = (known after apply)
          + target_group_arn = (known after apply)
          + type             = "forward"
        }
    }

  # module.bff_alb.aws_lb_target_group.tg will be created
  + resource "aws_lb_target_group" "tg" {
      + arn                                = (known after apply)
      + arn_suffix                         = (known after apply)
      + connection_termination             = false
      + deregistration_delay               = "300"
      + id                                 = (known after apply)
      + ip_address_type                    = (known after apply)
      + lambda_multi_value_headers_enabled = false
      + load_balancing_algorithm_type      = (known after apply)
      + load_balancing_cross_zone_enabled  = (known after apply)
      + name                               = "bff-service-tg"
      + port                               = 8081
      + preserve_client_ip                 = (known after apply)
      + protocol                           = "HTTP"
      + protocol_version                   = (known after apply)
      + proxy_protocol_v2                  = false
      + slow_start                         = 0
      + tags_all                           = (known after apply)
      + target_type                        = "instance"
      + vpc_id                             = (known after apply)

      + health_check {
          + enabled             = true
          + healthy_threshold   = 2
          + interval            = 60
          + matcher             = "200"
          + path                = "/health"
          + port                = "traffic-port"
          + protocol            = "HTTP"
          + timeout             = 30
          + unhealthy_threshold = 2
        }
    }

  # module.ecs_bff.aws_ecs_service.service[0] will be created
  + resource "aws_ecs_service" "service" {
      + cluster                            = (known after apply)
      + deployment_maximum_percent         = 200
      + deployment_minimum_healthy_percent = 100
      + desired_count                      = 2
      + enable_ecs_managed_tags            = false
      + enable_execute_command             = false
      + iam_role                           = (known after apply)
      + id                                 = (known after apply)
      + launch_type                        = "FARGATE"
      + name                               = "bff-service"
      + platform_version                   = (known after apply)
      + scheduling_strategy                = "REPLICA"
      + tags_all                           = (known after apply)
      + task_definition                    = (known after apply)
      + triggers                           = (known after apply)
      + wait_for_steady_state              = false

      + load_balancer {
          + container_name   = "bff-service"
          + container_port   = 8081
          + target_group_arn = (known after apply)
        }

      + network_configuration {
          + assign_public_ip = true
          + security_groups  = (known after apply)
          + subnets          = (known after apply)
        }
    }

  # module.ecs_bff.aws_ecs_task_definition.task[0] will be created
  + resource "aws_ecs_task_definition" "task" {
      + arn                      = (known after apply)
      + arn_without_revision     = (known after apply)
      + container_definitions    = (known after apply)
      + cpu                      = "1024"
      + execution_role_arn       = (known after apply)
      + family                   = "bff-task"
      + id                       = (known after apply)
      + memory                   = "512"
      + network_mode             = "awsvpc"
      + requires_compatibilities = [
          + "FARGATE",
        ]
      + revision                 = (known after apply)
      + skip_destroy             = false
      + tags_all                 = (known after apply)
    }

  # module.ecs_gtw.aws_ecs_service.service[0] will be created
  + resource "aws_ecs_service" "service" {
      + cluster                            = (known after apply)
      + deployment_maximum_percent         = 200
      + deployment_minimum_healthy_percent = 100
      + desired_count                      = 2
      + enable_ecs_managed_tags            = false
      + enable_execute_command             = false
      + iam_role                           = (known after apply)
      + id                                 = (known after apply)
      + launch_type                        = "FARGATE"
      + name                               = "bff-service"
      + platform_version                   = (known after apply)
      + scheduling_strategy                = "REPLICA"
      + tags_all                           = (known after apply)
      + task_definition                    = (known after apply)
      + triggers                           = (known after apply)
      + wait_for_steady_state              = false

      + load_balancer {
          + container_name   = "gtw-service"
          + container_port   = 8080
          + target_group_arn = (known after apply)
        }

      + network_configuration {
          + assign_public_ip = true
          + security_groups  = (known after apply)
          + subnets          = (known after apply)
        }
    }

  # module.ecs_gtw.aws_ecs_task_definition.task[0] will be created
  + resource "aws_ecs_task_definition" "task" {
      + arn                      = (known after apply)
      + arn_without_revision     = (known after apply)
      + container_definitions    = (known after apply)
      + cpu                      = "1024"
      + execution_role_arn       = (known after apply)
      + family                   = "gtw-task"
      + id                       = (known after apply)
      + memory                   = "512"
      + network_mode             = "awsvpc"
      + requires_compatibilities = [
          + "FARGATE",
        ]
      + revision                 = (known after apply)
      + skip_destroy             = false
      + tags_all                 = (known after apply)
    }

  # module.gtw_alb.aws_lb.alb will be created
  + resource "aws_lb" "alb" {
      + arn                                         = (known after apply)
      + arn_suffix                                  = (known after apply)
      + desync_mitigation_mode                      = "defensive"
      + dns_name                                    = (known after apply)
      + drop_invalid_header_fields                  = false
      + enable_deletion_protection                  = false
      + enable_http2                                = true
      + enable_tls_version_and_cipher_suite_headers = false
      + enable_waf_fail_open                        = false
      + enable_xff_client_port                      = false
      + id                                          = (known after apply)
      + idle_timeout                                = 60
      + internal                                    = false
      + ip_address_type                             = (known after apply)
      + load_balancer_type                          = "application"
      + name                                        = "gtw-alb"
      + preserve_host_header                        = false
      + security_groups                             = (known after apply)
      + subnets                                     = (known after apply)
      + tags_all                                    = (known after apply)
      + vpc_id                                      = (known after apply)
      + xff_header_processing_mode                  = "append"
      + zone_id                                     = (known after apply)
    }

  # module.gtw_alb.aws_lb_listener.listener will be created
  + resource "aws_lb_listener" "listener" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + load_balancer_arn = (known after apply)
      + port              = 80
      + protocol          = "HTTP"
      + ssl_policy        = (known after apply)
      + tags_all          = (known after apply)

      + default_action {
          + order            = (known after apply)
          + target_group_arn = (known after apply)
          + type             = "forward"
        }
    }

  # module.gtw_alb.aws_lb_target_group.tg will be created
  + resource "aws_lb_target_group" "tg" {
      + arn                                = (known after apply)
      + arn_suffix                         = (known after apply)
      + connection_termination             = false
      + deregistration_delay               = "300"
      + id                                 = (known after apply)
      + ip_address_type                    = (known after apply)
      + lambda_multi_value_headers_enabled = false
      + load_balancing_algorithm_type      = (known after apply)
      + load_balancing_cross_zone_enabled  = (known after apply)
      + name                               = "gtw-service-tg"
      + port                               = 8080
      + preserve_client_ip                 = (known after apply)
      + protocol                           = "HTTP"
      + protocol_version                   = (known after apply)
      + proxy_protocol_v2                  = false
      + slow_start                         = 0
      + tags_all                           = (known after apply)
      + target_type                        = "instance"
      + vpc_id                             = (known after apply)

      + health_check {
          + enabled             = true
          + healthy_threshold   = 2
          + interval            = 60
          + matcher             = "200"
          + path                = "/health"
          + port                = "traffic-port"
          + protocol            = "HTTP"
          + timeout             = 30
          + unhealthy_threshold = 2
        }
    }

  # module.iam.aws_iam_role.codebuild_role will be created
  + resource "aws_iam_role" "codebuild_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "codebuild.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "codebuild-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + role_last_used        = (known after apply)
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)
    }

  # module.iam.aws_iam_role.codedeploy_role will be created
  + resource "aws_iam_role" "codedeploy_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "codedeploy.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "codedeploy-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + role_last_used        = (known after apply)
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)
    }

  # module.iam.aws_iam_role.codepipeline_role will be created
  + resource "aws_iam_role" "codepipeline_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "codepipeline.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "codepipeline-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + role_last_used        = (known after apply)
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)
    }

  # module.iam.aws_iam_role.ecs_auto_scale_role will be created
  + resource "aws_iam_role" "ecs_auto_scale_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "application-autoscaling.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "EcsAutoScaleRole"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + role_last_used        = (known after apply)
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)
    }

  # module.iam.aws_iam_role.ecs_task_execution_role will be created
  + resource "aws_iam_role" "ecs_task_execution_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ecs-tasks.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "ecs-execution-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + role_last_used        = (known after apply)
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)
    }

  # module.iam.aws_iam_role.ecs_task_role will be created
  + resource "aws_iam_role" "ecs_task_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ecs-tasks.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "ecs-task-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + role_last_used        = (known after apply)
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)
    }

  # module.iam.aws_iam_role_policy.codebuild_service_role_policy will be created
  + resource "aws_iam_role_policy" "codebuild_service_role_policy" {
      + id     = (known after apply)
      + name   = (known after apply)
      + policy = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "logs:CreateLogGroup",
                          + "logs:CreateLogStream",
                          + "logs:PutLogEvents",
                          + "s3:PutObject",
                          + "s3:GetObject",
                          + "s3:GetObjectVersion",
                          + "s3:ListBucket",
                          + "codebuild:BatchGetBuilds",
                          + "codebuild:StartBuild",
                          + "codebuild:BatchGetProjects",
                          + "ec2:DescribeSubnets",
                          + "ec2:DescribeSecurityGroups",
                          + "ec2:DescribeVpcs",
                          + "ec2:CreateNetworkInterface",
                          + "ec2:DescribeNetworkInterfaces",
                          + "ec2:DeleteNetworkInterface",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role   = (known after apply)
    }

  # module.iam.aws_iam_role_policy.codedeploy_service_role_policy will be created
  + resource "aws_iam_role_policy" "codedeploy_service_role_policy" {
      + id     = (known after apply)
      + name   = (known after apply)
      + policy = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "ecs:DescribeServices",
                          + "ecs:UpdateService",
                          + "ecs:DescribeTaskDefinition",
                          + "ecs:DescribeTasks",
                          + "ecs:ListTasks",
                          + "events:PutRule",
                          + "events:PutTargets",
                          + "events:DescribeRule",
                          + "lambda:InvokeFunction",
                          + "s3:GetObject",
                          + "s3:GetObjectVersion",
                          + "s3:GetBucketVersioning",
                          + "application-autoscaling:RegisterScalableTarget",
                          + "application-autoscaling:DeleteScalingPolicy",
                          + "application-autoscaling:DeregisterScalableTarget",
                          + "application-autoscaling:DescribeScalableTargets",
                          + "application-autoscaling:PutScalingPolicy",
                          + "application-autoscaling:DescribeScalingPolicies",
                          + "cloudwatch:DescribeAlarms",
                          + "cloudwatch:PutMetricAlarm",
                          + "cloudwatch:DeleteAlarms",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role   = (known after apply)
    }

  # module.iam.aws_iam_role_policy.codepipeline_service_role_policy will be created
  + resource "aws_iam_role_policy" "codepipeline_service_role_policy" {
      + id     = (known after apply)
      + name   = (known after apply)
      + policy = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "codepipeline:*",
                          + "codebuild:BatchGetBuilds",
                          + "codebuild:StartBuild",
                          + "codebuild:BatchGetProjects",
                          + "codebuild:BatchGetBuildBatches",
                          + "codebuild:ListBuildsForProject",
                          + "codedeploy:RegisterApplicationRevision",
                          + "codedeploy:GetApplicationRevision",
                          + "codedeploy:GetDeploymentConfig",
                          + "codedeploy:CreateDeployment",
                          + "codedeploy:GetDeployment",
                          + "codedeploy:GetDeploymentGroup",
                          + "s3:PutObject",
                          + "s3:GetObject",
                          + "s3:GetObjectVersion",
                          + "s3:GetBucketVersioning",
                          + "s3:PutBucketVersioning",
                          + "s3:PutBucketAcl",
                          + "s3:GetBucketAcl",
                          + "cloudwatch:*",
                          + "codestar-connections:UseConnection",
                          + "iam:PassRole",
                          + "lambda:InvokeFunction",
                          + "lambda:GetFunctionConfiguration",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role   = (known after apply)
    }

  # module.iam.aws_iam_role_policy_attachment.codebuild_attach will be created
  + resource "aws_iam_role_policy_attachment" "codebuild_attach" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AWSCodeBuildDeveloperAccess"
      + role       = "codebuild-role"
    }

  # module.iam.aws_iam_role_policy_attachment.codedeploy_attach will be created
  + resource "aws_iam_role_policy_attachment" "codedeploy_attach" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AWSCodeDeployRole"
      + role       = "codedeploy-role"
    }

  # module.iam.aws_iam_role_policy_attachment.codepipeline_attach will be created
  + resource "aws_iam_role_policy_attachment" "codepipeline_attach" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AWSCodePipeline_FullAccess"
      + role       = "codepipeline-role"
    }

  # module.iam.aws_iam_role_policy_attachment.ecs-task-execution-role-policy-attachment will be created
  + resource "aws_iam_role_policy_attachment" "ecs-task-execution-role-policy-attachment" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AmazonECSTaskExecutionRolePolicy"
      + role       = "ecs-execution-role"
    }

  # module.iam.aws_iam_role_policy_attachment.ecs_auto_scale_role will be created
  + resource "aws_iam_role_policy_attachment" "ecs_auto_scale_role" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AmazonEC2ContainerServiceAutoscaleRole"
      + role       = "EcsAutoScaleRole"
    }

  # module.iam.aws_iam_role_policy_attachment.task_s3 will be created
  + resource "aws_iam_role_policy_attachment" "task_s3" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonS3FullAccess"
      + role       = "ecs-task-role"
    }

  # module.vpc.aws_internet_gateway.gw will be created
  + resource "aws_internet_gateway" "gw" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + owner_id = (known after apply)
      + tags_all = (known after apply)
      + vpc_id   = (known after apply)
    }

  # module.vpc.aws_route.internet_access will be created
  + resource "aws_route" "internet_access" {
      + destination_cidr_block = "0.0.0.0/0"
      + gateway_id             = (known after apply)
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = (known after apply)
      + state                  = (known after apply)
    }

  # module.vpc.aws_subnet.private[0] will be created
  + resource "aws_subnet" "private" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "eu-west-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "172.17.0.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags_all                                       = (known after apply)
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_subnet.private[1] will be created
  + resource "aws_subnet" "private" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "eu-west-1b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "172.17.1.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags_all                                       = (known after apply)
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_subnet.public[0] will be created
  + resource "aws_subnet" "public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "eu-west-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "172.17.2.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags_all                                       = (known after apply)
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_subnet.public[1] will be created
  + resource "aws_subnet" "public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "eu-west-1b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "172.17.3.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags_all                                       = (known after apply)
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_vpc.main will be created
  + resource "aws_vpc" "main" {
      + arn                                  = (known after apply)
      + cidr_block                           = "172.17.0.0/16"
      + default_network_acl_id               = (known after apply)
      + default_route_table_id               = (known after apply)
      + default_security_group_id            = (known after apply)
      + dhcp_options_id                      = (known after apply)
      + enable_classiclink                   = (known after apply)
      + enable_classiclink_dns_support       = (known after apply)
      + enable_dns_hostnames                 = (known after apply)
      + enable_dns_support                   = true
      + enable_network_address_usage_metrics = (known after apply)
      + id                                   = (known after apply)
      + instance_tenancy                     = "default"
      + ipv6_association_id                  = (known after apply)
      + ipv6_cidr_block                      = (known after apply)
      + ipv6_cidr_block_network_border_group = (known after apply)
      + main_route_table_id                  = (known after apply)
      + owner_id                             = (known after apply)
      + tags_all                             = (known after apply)
    }

Plan: 38 to add, 4 to change, 38 to destroy.

```

</details>

*Pusher: @mandicm223, Action: `pull_request`, Working Directory: ``, Workflow: `Terraform Workflow`*